## Лабороторная работа №2

### Задание 1

Построить зависимость между количеством элементов и количеством шагов для алгоритмов со сложностью $О(1)$, $O(log n)$, $O(n^2)$, $O(2^n)$. Сравнить сложность данных алгоритмов.

#### Алгоритм со сложностью $О(1)$ (Произведение двух чисел)

```
def multiply(a, b):
    return a * b

a = 2
b = 5

print('Первое число -', a, ', второе число -', b)
print('Произведение чисел -', multiply(a, b))
```

> Количество элементов - 2, количество шагов для алгоритма - 1

#### Алгоритм со сложностью $О(log n)$ (Бинарный поиск)

```
def binary_search(arr, search_item):
    low = 0
    high = len(arr) - 1
    search_res = False
    col = 0

    while (low <= high) and (not search_res):
        col += 1
        middle = (low + high) // 2
        guess = arr[middle]
        if guess == search_item:
            search_res = True
        if guess > search_item:
            high = middle - 1
        else:
            low = middle + 1
    return [search_res, col]


arr = [3, 5, 11, 12, 15, 23, 25, 34, 67, 86]
value = 67

result = binary_search(arr, value)
if result[0]:
    print('Найденное число -', result[1])
else:
    print('Не найден')
```

> Количество элементов - 16, количество шагов для алгоритма - 4

#### Алгоритм со сложностью $О(n^2)$ (Сумма всех возможных пар элементов в массиве)

```
def sum_of_pairs(arr):
    n = len(arr)
    total = 0
    for i in range(n):
        for j in range(i+1, n):
            total += arr[i] + arr[j]
    return total

arr = [10, 23, 1, 32, 5, 7, 9, 12, 72]
result = sum_of_pairs(arr)
print(print('Сумма всех возможных пар элементов -', result))
```

> Количество элементов - 10, количество шагов для алгоритма - 100

#### Алгоритм со сложностью $О(2^n)$ (Нахождение числа Фибоначчи)

```
def fibonacci(n):
    if n <= 1:
        return n
    else:
        return fibonacci(n-1) + fibonacci(n-2)

n = 10
result = fibonacci(n)
print('Число Фибоначчи под номером 10 -', result)
```

> Значение элемента - 5, количество шагов для алгоритма - 32

### Задание 2

Написать программу для пузырьковой сортировки. Оценить сложность данного метода. Сравнить с методом sort

```
def bubble_sort(arr):
    n = len(arr)
    # Повторяем проходы через массив n-1 раз
    for i in range(n-1):
        # Перебираем элементы массива от 0 до n-i-1
        for j in range(0, n-i-1):
            # Если текущий элемент больше следующего, меняем их местами
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    return arr


arr = [6, 5, 3, 4, 8, 0, 10, 100, 20, 14]
print('Изначальный массив:', arr)

result = bubble_sort(arr)
print('Отсортированный массив:', result)
```

> Сложность сортировки пузырьковым методом составляет $O(n^2)$. То есть, к примеру, для 10 элементов в худшем случае количество шагов составит 100.

### Задание 3

Придумать и реализовать алгоритмы, имеющие сложность $O(3n)$, $O(n \cdot logn)$, $O(n!)$, $O(n^3)$, $O(3log(n))$

#### Алгоритм со сложностью $О(3n)$ (Сумма все возможных комбинации троек чисел в массиве)

```
def find_triples_sum(arr):
    n = len(arr)
    total_sum = 0

    # Внешний цикл
    for i in range(n):

        # Средний цикл
        for j in range(i + 1, n):

            # Внутренний цикл
            for k in range(j + 1, n):
                total_sum += arr[i] + arr[j] + arr[k]

    return total_sum

arr = [1, 2, 5, 8, 9, 2]
result = find_triples_sum(arr)
print('Сумма все возможных комбинации троек чисел в массиве -', result)
```

> В этой программе мы используем три вложенных цикла $for$ для итерации через массив. Внешний цикл выполняется n раз, средний цикл выполняется $n-1$ раз (так как он начинается со второго элемента), а внутренний цикл также выполняется $n-2$ раза. Таким образом, общая сложность этого алгоритма составляет $O(3n)$.


#### Алгоритм со сложностью $О(n \cdot log n)$ (Сортировка слиянием)
```
def merge_sort(arr):
    if len(arr) > 1:
        mid = len(arr) // 2
        left_half = arr[:mid]
        right_half = arr[mid:]

        merge_sort(left_half)
        merge_sort(right_half)

        i = j = k = 0

        while i < len(left_half) and j < len(right_half):
            if left_half[i] < right_half[j]:
                arr[k] = left_half[i]
                i += 1
            else:
                arr[k] = right_half[j]
                j += 1
            k += 1

        while i < len(left_half):
            arr[k] = left_half[i]
            i += 1
            k += 1

        while j < len(right_half):
            arr[k] = right_half[j]
            j += 1
            k += 1

    return arr

arr = [6, 5, 3, 4, 8, 0, 10, 100, 20, 14]
print('Изначальный массив:', arr)

result = merge_sort(arr)
print('Отсортированный массив:', result)
```

>Эта программа использует рекурсивный подход к сортировке массива. Общая сложность данной программы - $O(n \cdot log n)$, так как каждый уровень рекурсии имеет сложность $O(n)$, а глубина рекурсии - $O(log n)$.

#### Алгоритм со сложностью $О(n!)$ (Все перестановки элементов заданного массива)
```
def permutations(lst):
    if len(lst) == 0:
        return [[]]
    result = []
    for i in range(len(lst)):
        rest = lst[:i] + lst[i+1:]
        for p in permutations(rest):
            result.append([lst[i]] + p)
    return result

my_list = [1, 2, 3]
print(permutations(my_list))
```

>Эта программа вычисляет все возможные перестановки элементов списка, используя рекурсию. Время выполнения этой программы будет O(n!), где n - количество элементов в списке. Это происходит из-за того, что каждый элемент может находиться на любой позиции в каждой перестановке, и в итоге общее количество перестановок будет равно n! (n факториал).

#### Алгоритм со сложностью $О(n^3)$ (Все возможные комбинации элементов двумерного массива)

```
def sum_of_cubes(lst):
    n = len(lst)
    result = 0
    for i in range(n):
        for j in range(n):
            for k in range(n):
                result += lst[i][j][k] ** 3
    return result

my_list = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]
print(sum_of_cubes(my_list))
```

>Эта программа вычисляет сумму кубов всех элементов в двумерном списке. Время выполнения этой программы будет O(n^3), где n - размерность списка (в данном случае равна 2). Это происходит из-за того, что программа использует три вложенных цикла для перебора всех возможных комбинаций элементов списка. Каждый цикл выполняется n раз, поэтому общее время выполнения программы будет пропорционально n^3.