## Лабороторная работа №2

### Задание 1

Построить зависимость между количеством элементов и количеством шагов для алгоритмов со сложностью $О(1)$, $O(log n)$, $O(n^2)$, $O(2^n)$. Сравнить сложность данных алгоритмов.

#### Алгоритм со сложностью $О(1)$ (Произведение двух чисел)
```
def multiply(a, b):
    return a * b

a = 2
b = 5

print('Первое число -', a, ', второе число -', b)
print('Произведение чисел -', multiply(a, b))
```

> Количество элементов - 2, количество шагов для алгоритма - 1

### Задание 2

Написать программу для пузырьковой сортировки. Оценить сложность данного метода. Сравнить с методом sort

```
def bubble_sort(arr):
    n = len(arr)
    # Повторяем проходы через массив n-1 раз
    for i in range(n-1):
        # Перебираем элементы массива от 0 до n-i-1
        for j in range(0, n-i-1):
            # Если текущий элемент больше следующего, меняем их местами
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    return arr


arr = [6, 5, 3, 4, 8, 0, 10, 100, 20, 14]
print('Изначальный массив:', arr)

result = bubble_sort(arr)
print('Отсортированный массив:', result)
```

> Сложность сортировки пузырьковым методом составляет $O(n^2)$. То есть к примеру для 10 элементов, в худшем случае количество шагов составит 100.

### Задание 3

Придумать и реализовать алгоритмы, имеющие сложность $O(3n)$, $O(n \cdot logn)$, $O(n!)$, $O(n^3)$, $O(3log(n))$

```
Код
```